MasEmIOT/Final_Project_CTTN/code/LoraGateway/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32"
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_PARTITION_TABLE_SINGLE_APP_LARGE=y

# Tick 1000Hz: tranh vTaskDelay nho bi lam tron 0 tick (gay 100% CPU + loi LoRa).
CONFIG_FREERTOS_HZ=1000

# Console tren UART0 (USB-UART CP2102/CH340) de HIL tool tren PC giao tiep qua COM 115200.
CONFIG_ESP_CONSOLE_UART_DEFAULT=y
CONFIG_ESP_CONSOLE_UART_BAUDRATE=115200

# HTTP server local (bo Firebase) - tang so handler & buffer header
CONFIG_HTTPD_MAX_REQ_HDR_LEN=1024
CONFIG_LWIP_MAX_SOCKETS=16

# Task Watchdog
CONFIG_ESP_TASK_WDT_INIT=y
CONFIG_ESP_TASK_WDT_TIMEOUT_S=10
